{"nodes": [{"value": 0, "metadata": {"agentRole": "Planning Agent", "taskDesc": "Dynamically Synthesize Agents and Orchestrate Information Passing", "agentDesc": "Dynamically Synthesize Agents and Orchestrate Information Passing", "tools": []}}, {"value": 1, "metadata": {"agentRole": "US Case Law Researcher", "taskDesc": "Retrieve American legal data and case laws regarding child harassment.", "agentDesc": "A legal researcher specializing in US case law, focusing on child harassment and abuse cases. Responsibilities include gathering and analyzing relevant legal documents and precedents.", "tools": ["get_us_case_law"], "connected_to": []}}, {"value": 2, "metadata": {"agentRole": "Indian Legal Researcher", "taskDesc": "Retrieve Indian legal data and case laws regarding child harassment.", "agentDesc": "A legal researcher specializing in Indian law regarding child rights and harassment, tasked with obtaining and interpreting relevant legal cases.", "tools": ["get_indian_kanoon"], "connected_to": []}}, {"value": 3, "metadata": {"agentRole": "Public Policy Researcher", "taskDesc": "Research public policies in relation to child protection against harassment.", "agentDesc": "A researcher focused on public policies that protect children and address child harassment. Responsible for identifying effective frameworks being implemented.", "tools": ["web_search"], "connected_to": []}}, {"value": 4, "metadata": {"agentRole": "Ethics Researcher", "taskDesc": "Examine the societal and psychological impacts of child harassment.", "agentDesc": "A specialist in ethics and psychology, tasked with analyzing the societal implications and the psychological effects of child harassment.", "tools": ["web_search"], "connected_to": []}}, {"value": 5, "metadata": {"agentRole": "Legal Consequences Analyst", "taskDesc": "Investigate the potential legal consequences for individuals guilty of child harassment.", "agentDesc": "An analyst specializing in the legal repercussions faced by offenders of child harassment, required to compile data on sentencing and legal outcomes.", "tools": ["get_us_case_law", "get_indian_kanoon"], "connected_to": ["task_1", "task_2"]}}], "edges": [{"source": 0, "target": 1}, {"source": 0, "target": 2}, {"source": 0, "target": 3}, {"source": 0, "target": 4}, {"source": 1, "target": 5}, {"source": 2, "target": 5}]}