{"nodes": [{"value": 0, "metadata": {"agentRole": "Planning Agent", "taskDesc": "Dynamically Synthesize Agents and Orchestrate Information Passing", "agentDesc": "Dynamically Synthesize Agents and Orchestrate Information Passing", "tools": []}}, {"value": 1, "metadata": {"agentRole": "Financial Analyst", "taskDesc": "Retrieve BTG's income statement, balance sheet, and cash flow statement for the last two years. This data forms the foundation for understanding the company's overall financial health.", "agentDesc": "The Financial Analyst is responsible for retrieving and analyzing financial statements to provide insights on the financial standings of the company.", "tools": ["get_income_stmt", "get_balance_sheet", "get_cash_flow"], "connected_to": []}}, {"value": 2, "metadata": {"agentRole": "Market Researcher", "taskDesc": "Based on the income statement retrieved in task_1, analyze the revenue for BTG's key product lines to identify any segments experiencing revenue decline over the last two years.", "agentDesc": "The Market Researcher will analyze the data retrieved in task_1, focusing on revenue by product line and identifying any decline.", "tools": ["get_income_stmt"], "connected_to": ["task_1"]}}, {"value": 3, "metadata": {"agentRole": "Financial Analyst", "taskDesc": "Based on the revenue analysis conducted in task_2, assess the margin trends for the identified product lines and calculate margins using revenue and cost data from the income statement.", "agentDesc": "The Financial Analyst will calculate and analyze margins for BTG's key product lines based on the revenue data provided in task_2.", "tools": ["get_income_stmt"], "connected_to": ["task_2"]}}, {"value": 4, "metadata": {"agentRole": "General Researcher", "taskDesc": "Compile results from tasks 2 and 3 to summarize and identify key findings on revenue declines and margin performance for BTG's product lines.", "agentDesc": "The General Researcher will synthesize findings from previous analyses to report on significant trends in revenue and margins.", "tools": [], "connected_to": ["task_2", "task_3"]}}], "edges": [{"source": 0, "target": 1}, {"source": 1, "target": 2}, {"source": 2, "target": 3}, {"source": 2, "target": 4}, {"source": 3, "target": 4}]}